app/controllers/admin/articles_controller.rb

  def new
    @article = Article.new
    @columns = Column.all
---
SELECT "columns".* FROM "columns"

  def edit
    @columns = Column.all
    @article = Article.find(params[:id])
---
SELECT "columns".* FROM "columns"
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @article = Article.new(params[:article])
    respond_to do |format|
      if @article.save #and
---
INSERT INTO "articles" ("column_article_id", "content", "created_at", "digest", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "publisher", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def drafted
    @articles = Article.where(status: 'drafted')
---
SELECT "articles".* FROM "articles" WHERE "articles"."status" = 'drafted'

  def update
    p "------"
    p params[:article][:column_ids]
    @article = Article.find(params[:id])
    respond_to do |format|
      if @article.update_attributes(params[:article])# and
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "articles" SET "image_file_name" = '屏幕截图_-_2013年09月12日_-_10时34分59秒.png', "image_content_type" = 'image/png', "image_file_size" = 697093, "image_updated_at" = '2013-09-17 10:51:30.749399', "status" = 'published', "updated_at" = '2013-09-17 10:51:34.827270' WHERE "articles"."id" = 1