app/controllers/admin/columns_controller.rb

  def index
    @columns = Column.all
---
SELECT "columns".* FROM "columns"

  def show
    @column = Column.find(params[:id])
---
SELECT "columns".* FROM "columns" WHERE "columns"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @column = Column.find(params[:id])
---
SELECT "columns".* FROM "columns" WHERE "columns"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @column = Column.new(params[:column])

    respond_to do |format|
      if @column.save
---
INSERT INTO "columns" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 17 Sep 2013 03:20:15 UTC +00:00], ["name", nil], ["updated_at", Tue, 17 Sep 2013 03:20:15 UTC +00:00]]

  def update
    @column = Column.find(params[:id])

    respond_to do |format|
      if @column.update_attributes(params[:column])
---
SELECT "columns".* FROM "columns" WHERE "columns"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "columns" SET "name" = '行情', "updated_at" = '2013-09-17 03:40:08.881635' WHERE "columns"."id" = 3

  def destroy
    @column = Column.find(params[:id])
    @column.destroy
---
SELECT "columns".* FROM "columns" WHERE "columns"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "columns" WHERE "columns"."id" = ?  [["id", 2]]