app/views/admin/articles/_form.html.slim

SELECT "columns".id FROM "columns" INNER JOIN "column_articles" ON "columns"."id" = "column_articles"."column_id" WHERE "column_articles"."article_id" IS NULL
---
  .control-group
    = f.label t('article.column'), :class => 'control-label', for: 'article_column_id'
    .controls.column_ids_controls

SELECT 1 AS one FROM "columns" INNER JOIN "articles_columns" ON "columns"."id" = "articles_columns"."column_id" WHERE "articles_columns"."article_id" IS NULL AND "columns"."id" = 1 LIMIT 1
---
        - id = column.id
        = check_box_tag('article[column_ids][]', column.id, @article.columns.include?(column), id: "column_#{id}")