app/views/admin/articles/index.html.slim

SELECT "articles".* FROM "articles"
---
        th= t('article.status')
        th= t('article.column')