app/views/admin/articles/show.html.slim

SELECT "columns".* FROM "columns" INNER JOIN "articles_columns" ON "columns"."id" = "articles_columns"."column_id" WHERE "articles_columns"."article_id" = 2
---
  tr
    th= t('article.column') + ':'