app/views/admin/columns/index.html.slim

div class="page-header"
  h1=t 'column.all'
---
SELECT "columns".* FROM "columns"