app/controllers/articles_controller.rb

  def index
    @articles = Article.published.includes(:columns)
      .paginate(:page => params[:page], per_page: 8)
---
SELECT "articles".* FROM "articles"